; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	thermograph6 - mode
	spectrograph4 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	infrared5 - mode
	infrared7 - mode
	infrared3 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph6)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared3)
	(supports instrument4 infrared7)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument5 spectrograph4)
	(supports instrument5 infrared5)
	(supports instrument5 infrared7)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph6)
	(supports instrument6 infrared7)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph6)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument8 thermograph6)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared7)
	(calibration_target instrument8 Star2)
	(supports instrument9 infrared5)
	(supports instrument9 infrared7)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 Star2)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
	(supports instrument11 infrared7)
	(calibration_target instrument11 Star2)
	(supports instrument12 spectrograph4)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 spectrograph1)
	(supports instrument13 infrared3)
	(calibration_target instrument13 GroundStation3)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon9)
)
(:goal (and
	(pointing satellite2 Phenomenon9)
	(have_image Phenomenon5 spectrograph0)
	(have_image Planet6 thermograph6)
	(have_image Planet7 infrared3)
	(have_image Phenomenon8 thermograph6)
	(have_image Phenomenon8 infrared5)
	(have_image Phenomenon9 infrared3)
	(have_image Star10 infrared2)
	(have_image Star10 infrared7)
))

)

; plan
1. (turn_to satellite2 groundstation0 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 9
3. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 9
4. (turn_to satellite2 star10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star10)
   goals met: 0 of 9
5. (take_image satellite2 star10 instrument5 infrared7)
   added: (have_image star10 infrared7)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 9
7. (turn_to satellite1 groundstation4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 9
8. (turn_to satellite0 groundstation4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 9
9. (take_image satellite2 phenomenon8 instrument5 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 2 of 9
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 9
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 9
12. (calibrate satellite1 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 2 of 9
13. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 9
14. (turn_to satellite0 phenomenon5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 9
15. (take_image satellite0 phenomenon5 instrument1 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 3 of 9
16. (turn_to satellite0 phenomenon8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 9
17. (take_image satellite0 phenomenon8 instrument1 thermograph6)
   added: (have_image phenomenon8 thermograph6)
   goals met: 4 of 9
18. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 4 of 9
19. (take_image satellite0 planet6 instrument1 thermograph6)
   added: (have_image planet6 thermograph6)
   goals met: 5 of 9
20. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 5 of 9
21. (take_image satellite0 star10 instrument1 infrared2)
   added: (have_image star10 infrared2)
   goals met: 6 of 9
22. (turn_to satellite1 phenomenon9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 9
23. (take_image satellite1 phenomenon9 instrument4 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 7 of 9
24. (turn_to satellite1 planet7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet7)
   goals met: 7 of 9
25. (take_image satellite1 planet7 instrument4 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 8 of 9
26. (turn_to satellite2 phenomenon9 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon9)
   goals met: 9 of 9
